[{"ques":"What is spandex?","ans":"Spandex fibers are extremely elastic. They are used for such purpose as foundation garments, hosiery, swim wear and sports wear."},{"ques":"Do you know what is the standard of cotton yarn count?","ans":"The standard for the yarn count in cotton is I pound of fiber drawn out to make 840 yards of yarn. The resultant thickness or size is known as count number 1 or Ne1."},{"ques":"Tell me what are three basics stitches in weft knitting?","ans":"Plain Knit stitch\n☛ Purl stitch\n☛ Rib stitch"},{"ques":"Explain me how non-woven fabrics are made?","ans":"The non-woven fabrics are made by interlocking or bonding of fibers through mechanical, chemical, thermal or solvent means. Different types of fabric are used for nonwovens like wool, cotton, polyester, acrylic, etc."},{"ques":"Explain me what is wale and course in the textile industry?","ans":"Course: In Knitted fabric loop, the total amount of horizontal rows is known as Course.\n☛ Wale: In Knitted fabric loop the total amount of vertical rows is known as Wale."},{"ques":"Do you know what is nylon?","ans":"Nylon is thermoplastic, resilient, elastic and very strong. It is used for a wide variety of apparel, have furnishings and industrials products."},{"ques":"What is Topstitched Seam?","ans":"A plain seam with a row of machine stitching on one or both sides of the seam line is known as the top stitched seam."},{"ques":"Tell me what is Tufting?","ans":"Tufting is a type of method for textile weaving, which is done by pushing extra yarn into a fabric. In this process, many needles simultaneously punch the fabric at pre-determined distance for extruding the fibers. Tufting is usually done on carpets, blankets and upholstery."},{"ques":"Tell me what is linen fiber?","ans":"Linen fiber is obtained from the stoke of the flax plant linen yarn can be very strong and lustrous and in used for apparel, have furnishings and upholstery."},{"ques":"Tell me what is Selvage?","ans":"Selvage is the Lengthwise finished edges on all woven fabrics. Running parallel to the lengthwise grain.\n\nDownload Interview PDF "},{"ques":"Tell me the fundamental principle of Knitting?","ans":"The basic principle of knitting is that a single yarn which is formed into interlocking loops with the help of hooked needles. The loops may be closely or loosely constructed."},{"ques":"Tell me any three mineral fibers?","ans":"Glass,\n☛ ceramic,\n☛ graphite"},{"ques":"Tell me what is chemical and auxillaries in the textile industry?","ans":"In the textile industry, a dyeing auxillaries is a chemical or formulated chemical which allows a processing operation in preparation, dyeing, printing or finishing to be carried out more effectively."},{"ques":"What is seam finish?","ans":"Seam Finish istheTreatment on seam edges to prevent raveling and make the seam stronger and last longer."},{"ques":"What is Dolman?","ans":"Dolman means the Sleeve set into a deep armhole so as to resemble a kimono sleeve."},{"ques":"Tell me what is ANSI?","ans":"American National Standards Institute."},{"ques":"What is Pinking?","ans":"Cutting raw edges with pinking or scalloping sheers to prevent raveling."},{"ques":"Tell me what it takes to become a textile manufacturer?","ans":"A textile manufacturer requires following things\n\n☛ Knowledge of how to operate and manage robotic machinery\n☛ Good knowledge of market and dealing with textile supplier, textile exporter and importer\n☛ Dealing with a high cost of repairing and obtaining equipment\n☛ Labor costs of acquiring highly trained workers needed to operate this machinery\n☛ Acquiring raw material and negotiation skills"},{"ques":"What is Lapels?","ans":"A Part of a garment that turns back, especially the front neck- line fold of a jacket."},{"ques":"What is Back stitching?","ans":"Sewing backward and forward in the same place to secure stitching, is known as Backstitching.\n\nDownload Interview PDF "},{"ques":"Tell me what is Seam allowance?","ans":"Seam allowance means the Width of fabric beyond the seam line, not including the garment area."},{"ques":"What is Finger Press?","ans":"Finger press means the Pressing a small area by crease with the fingers."},{"ques":"What is Ravel?","ans":"Ravel means the fray in the cutting edges of the fabric."},{"ques":"What is Casing?","ans":"Casing is a folded-over edge of garment or area through which elastic or ribbon is threaded."},{"ques":"What is Keyhole?","ans":"A rounded neckline with an inverted, wedge-shaped opening at front or back."},{"ques":"Tell me what are the different ways of Textile Quality Control?","ans":"Spectrophotometer: It is used to check the color of the fabric\n☛ CCP ( Crucial Control Point): It is used to check raw material, stitch strength and fabric durability\n☛ Quality Check by industrial governing body: In U.S.A, this body is known as Association for Contract Textiles (ACT). It often imposes standard for textile quality control\n☛ Use of UltraViolet: The fabric is exposed to ultraviolet rays that simulate the sun's ray to check its durability."},{"ques":"Tell me what is habutae?","ans":"It is a silk fabric specially produced only in Japan but recently the reverse trend of importing this from China and Korea is increasing."},{"ques":"What is Blind hem?","ans":"Blind hem means the Sewing a hem invisibly with hand or machine stitches."},{"ques":"Tell me what is Match?","ans":"To bring notches or other construction markings on two pieces together."},{"ques":"What is Seam binding?","ans":"Seam binding is the Ribbon-like tape used to finish edges.\n\nDownload Interview PDF "},{"ques":"Tell me what is Fusible web?","ans":"Fusible web is a web-like adhesive that melts when you apply heat and moisture."},{"ques":"Tell me what is Dart?","ans":"Dart is a tuck in the fabric that helps in fitting the garment over the body curve."},{"ques":"Tell me what is spandex?","ans":"Spandex is a special type of synthetic fiber made from a long chain of synthetic polymer known as polyurethane. It is also known as lycra and it's more important characteristics is stretchability. It can stretch up to 500% to its normal size and its widely used for preparing sportswear."},{"ques":"What is Applique?","ans":"Applique is A cut-out decoration, design or motif applied to base fabric."},{"ques":"What is Fell stitch?","ans":"Fell stitch is a Neat, tiny, vertical stitches used in tailoring."},{"ques":"Tell me what is Serger?","ans":"A machine that overcasts and trims an edge simultaneously."},{"ques":"What is Pre-shrink?","ans":"Washing/dry-cleaning fabric to allow for shrinkage of fabric before the garment construction."},{"ques":"Tell me what is Self fabric?","ans":"Self fabric means the same material as the rest of the garment."},{"ques":"What is Notions?","ans":"Items other than fabric or a pat- tern required to complete a garment, such as buttons, thread, zipper, etc."},{"ques":"What is Drum Lining?","ans":"Drum lining is the Lining not sewn into garment seams.\n\nDownload Interview PDF "},{"ques":"Do you know what is seam?","ans":"Seam is joining of pieces of fabric together with stitching."},{"ques":"Tell me any four vegetable fibers?","ans":"Cotton,\n☛ linen,\n☛ jute,\n☛ hemp"},{"ques":"What is seam Allowance?","ans":"Seam Allowance is the Width between fabric edge and seam line ."},{"ques":"What is Bolt?","ans":"Bolt is the Unit in which fabric is packaged and sold by the manufacturer. Usually contains 12 to 20 yards."},{"ques":"What is Ease?","ans":"Ease is the even distribution of slight fullness when one section of a seam is joined to a slightly shorter section without forming gathers or tucks. Used to shape set-in sleeves, princess seams, etc."},{"ques":"Tell me what is Hem?","ans":"Hem is the finished portion on skirts, jackets and sleeves held in place with a hemming stitch."},{"ques":"What is Rip?","ans":"To remove stitches improperly placed; also tearing fabric along the straight grain."},{"ques":"What is Shirt waist?","ans":"Dress with bodice details similar to a shirt."},{"ques":"What is Plain Seam?","ans":"Plain Seam is the Most common type of seam, Suitable for all areas of a garment and fabrics except for sheers and laces."},{"ques":"What is Baste?","ans":"Baste is the Stitches made by hand or machine to hold fabric pieces together temporarily.\n\nDownload Interview PDF "},{"ques":"What is Double-breasted front?","ans":"Double-breasted means Front closing that overlaps enough to allow two rows of buttons."},{"ques":"What is Gore?","ans":"Gore i s a tapered section of a garment; wider at the lower edge."},{"ques":"Do you know what is Line?","ans":"Line means Style, outline or effect given by the cut and construction of a garment."},{"ques":"What is Pintuck?","ans":"A narrow channel of fabric stitched together to form tuck design detail, used in French hand sewing."},{"ques":"What is Silhouette?","ans":"Silhouette means the Outline or contour of a figure or garment."},{"ques":"What is Semi-fitted?","ans":"Fitting to conform partly, but not too closely, to the shape of the figure."},{"ques":"What is Princess line?","ans":"Garment fitted with seams instead of darts."},{"ques":"What is Miter?","ans":"Miter – To form a diagonal seam at a square corner."},{"ques":"What is Gusset?","ans":"Gusset is a fabric piece inserted at the un der arm to give ease in the sleeve area."},{"ques":"What is Fly?","ans":"Fly means the fabric used as lap to conceal an opening in a garment.\n\nDownload Interview PDF "},{"ques":"What is Empire?","ans":"Empire is a High waistline bodice with a loose, straight skirt."},{"ques":"Tell me what is Closure?","ans":"Closure means that which opens or closes a garment (buttons, snaps, etc., or the area on which they are Placed)"},{"ques":"What is Asymmetrical?","ans":"Asymmetrical means the One-sided, not geometrically balanced."},{"ques":"Tell me what is Clipping?","ans":"Making straight cuts into the seam allowance is called clipping."},{"ques":"Do you know how electrostatic printing works for printing textiles?","ans":"In electrostatic printing a dye resin mixture is used, this mixture is spread on a screen bearing the design and then the fabric is passed into an electrostatic field under the screen. By effect of electro-static field, this dye resin mixture is pulled through the pattern area on the fabric."},{"ques":"Tell me what is ICS?","ans":"Integrated Composite Spinning 84"},{"ques":"What is ‘Natural fibers'?","ans":"Natural fibers that occur in nature can be classified as vegetable, animal, and mineral."},{"ques":"Tell me any three cellulosic fibers?","ans":"Rayon,\n☛ Acetate,\n☛ Triacetate"},{"ques":"Tell me what are the chemical based procedures used in textile manufacturing?","ans":"Scouring\n☛ Bleaching\n☛ Bleach clean up\n☛ De-sizing\n☛ Fabric softening\n☛ Mercerization\n☛ Dyeing & Printing"},{"ques":"Explain me what are the physical types of fibers?","ans":"The physical types of fibers are\n\n☛ Staple fibers: Fiber which is practically limited or finite length is called “Staple Fiber.” These are small length fiber like wool, cotton, jute, etc. It may be man-made or natural.\n\n☛ Filament fibers: Fibers with unlimited or infinite length are called filaments. It may be natural like silk or synthetic like nylon.\n\nDownload Interview PDF "},{"ques":"What is Grading?","ans":"Grading means theTrimming each seam allowance to a different width."},{"ques":"What is Boning?","ans":"Boning means the Flexible strips used to stiffen seams or edges."},{"ques":"What is Flare?","ans":"Flare is a Portion of garment that spreads out or widens."},{"ques":"Tell me what is Placket?","ans":"Garment opening fastened with zipper, snaps or buttons. Finish applied to sleeve opening with cuff."},{"ques":"Tell me what is Template?","ans":"Template is a shape made of a stiff sub- stance, such as freezer paper, usually the size of the finished design. (i.e., pocket, applique shape or quilt pattern)"},{"ques":"What is Stay?","ans":"Stay it Means of maintaining the shape of a garment area, by using a small piece of fabric or tape that is sewn to an area of the garment to reinforce and secure a position."},{"ques":"Explain me what is Marking?","ans":"Marking is the Transfer of construction symbols from paper pattern to fabric."},{"ques":"What is Flap?","ans":"Flap is the shaped garment piece attached by only one edge, such as a flap pocket."},{"ques":"What is Chevron?","ans":"Chevron is a V-shaped stripes."},{"ques":"What is Hem?","ans":"A finished edge on a garment, one of the last steps in sewing a garment is called the hem.\n\nDownload Interview PDF "},{"ques":"Explain me what is glass fiber and where it is used?","ans":"Glass fiber is made up of fine fibers of glass; it is lightweight, extremely strong and robust. Compare to carbon fiber it is somewhat less strong, but it is less expensive and non-brittle. It is used for\n\n☛ Filament windings around rocket cases\n☛ Nose cones\n☛ Exhaust nozzle\n☛ Heat shields for aeronautical equipment\n☛ Fishing rods\n☛ Boat hulls and seats\n☛ Wall paneling"},{"ques":"Tell me what is ASTM?","ans":"American Society for Testing and Materials."},{"ques":"What is ‘Man made fibers'?","ans":"The natural material of cellulose has been taken from cotton linters and wood pulp, processed chemically, and changed in form and several other characteristics into fibers of various lengths."},{"ques":"What is yarn?","ans":"Yarn, which is woven, knitted, or otherwise made into fabric."},{"ques":"Tell me any three animal fibers?","ans":"Wool,\n☛ Silk,\n☛ Hair."},{"ques":"Tell me what is ISO?","ans":"International Organization for Standardization."},{"ques":"Explain what is the difference between yarn and thread?","ans":"There is three basic material you need to manufacture textile Thread, Yarn and Fiber. A Fiber is the basic raw material to produce yarn or thread. A textile Fiber could be natural or synthetic (man-made).\n\nThe difference between Yarn and Thread is\n\n☛ Yarn: It is a continuous twisted strand of wool, cotton or synthetic fibre used for Knitting or weaving purpose\n☛ Thread: It is a fine cord made up of two or more twisted fibres used in sewing and weaving"},{"ques":"Tell us how polyester is made?","ans":"Polyester is a pure synthetic material made from ethylene; it is derived from petroleum residue. It is prepared in four basic forms filament, staple, tow and fiberfill."},{"ques":"Tell me what are the different methods of dyeing?","ans":"Different types of dyeing methods are\n\n☛ Stock dyeing\n☛ Top dyeing\n☛ Yarn dyeing\n☛ Piece dyeing\n☛ Garment dyeing\n☛ Dope dyeing"},{"ques":"What is Basting?","ans":"Basting is the Temporarily joining layers of fabric together.\n\nDownload Interview PDF "},{"ques":"What is Binding?","ans":"Binding is the Strip to encase edges as a finish or trim."},{"ques":"What is contrasting?","ans":"Contrasting means the Opposing; showing off differences of color, fabric, shading, etc."},{"ques":"What is Finish?","ans":"Finish is any means of completing a raw garment edge to keep it from raveling, rolling or fraying."},{"ques":"Explain what is Join?","ans":"A term used in pattern directions that usually means to stitch together the pieces re ferred to using normal seam allowances and regular stitches."},{"ques":"What is Peplum?","ans":"Peplum is a Small flounce or extension of garment around the hips, usually from the bodice."},{"ques":"What is secure?","ans":"Fasten permanently by means of a knot, backstitching, etc."},{"ques":"What is Tension?","ans":"Tension – Amount of pull on thread or fabric during construction. Also the relationship of the needle and bobbin thread and how they interlock to form the sewing machine stitch, creat- ing a balanced, looser or tighter stitch."},{"ques":"What is Raw –edge?","ans":"Raw edge is the Unfinished edge of fabric."},{"ques":"Tell me what is Nap?","ans":"A Soft surface with fibers that lie smoothly in one direction."},{"ques":"What is Grosgrain?","ans":"Grosgrain means the Silk fabric or ribbon having heavy crosswise ribs.\n\nDownload Interview PDF "},{"ques":"What is enclosed seam?","ans":"Enclosed seam means the seam allowance along a faced edge that is stitched and turned to form an enclosed seam between two layers of fabric."},{"ques":"What is Crease?","ans":"Crease is a line made by folding the fabric and pressing the fold on this specified line ."},{"ques":"What is Notching?","ans":"Cutting V-shaped sections from the seam allowance is called notching."},{"ques":"Do you know what are benefits of Quality Inspection?","ans":"Reduce the cost associated with quality problems\n☛ Identify any non-conformity between the original product and pre-production sample\n☛ Enhances the relationship with suppliers"},{"ques":"Tell me what are the different types of textile equipment?","ans":"Different types of machines used in the textile industry are\n\n☛ Cotton Gin\n☛ Loom for weaving\n☛ Knitting Machines\n☛ Tufting Machines"},{"ques":"Tell me what is the fibre used to create linen?","ans":"To create linen FLAX fibre is used"},{"ques":"Explain what is polyester?","ans":"Polyester fibers are thermo plastic, they have good strength and are hydrophobic, do not absorb water well. Used for a wide variety of apparel, home furnishings and industrial fabrics."},{"ques":"What is mineral fibers?","ans":"Glass fibers are produced by combining silica sand, limestone, and certain other minerals."},{"ques":"Tell me two kinds of spinning machine?","ans":"Ring frame, mule frame."},{"ques":"Do you know what are the different types of cotton available?","ans":"Different types of cotton available are\n\n☛ Grey cotton fabric\n☛ Bleached cotton fabric\n☛ Color or dyed cotton fabric\n\nDownload Interview PDF "},{"ques":"What is two plant-based cotton source?","ans":"The two source for cotton from the plant\n\n☛ Cotton plant\n☛ Bamboo"},{"ques":"Do you know how many fibers can you yield from each cotton seed?","ans":"Each cotton seed may produce as many as 20,000 fibers on its surface, and a single ball will contains around 150,000 fibers."},{"ques":"What is French seam?","ans":"French Seam is narrow seam within a seam, used on fabrics which ravel easily ."},{"ques":"What is Armscye?","ans":"Armscye means the Armhole; opening for a sleeve."},{"ques":"What is Clean finish?","ans":"Clean finish means the method for finishing the raw edges of pockets, hems or seams."},{"ques":"What do you mean by fabric hand?","ans":"Fabric hand means the way a fabric feels and drapes; its flexibility, smooth- ness and softness."},{"ques":"Tell me what is Grade?","ans":"Grade means to reduce the bulk of enclosed seams by trimming the individu al seam allowances different widths, clipping inward curves and corners, notching convex curves, and trimming away excess fabric at outward corners."},{"ques":"Tell me what is Motif?","ans":"A Unit of design; used as decoration or pattern."},{"ques":"What is Right side of fabric?","ans":"Right side is the Finished side of fabric, outside of garment."},{"ques":"Tell me what is Shank?","ans":"The Link between button and fabric to allow for the thickness of overlapping fabric.\n\nDownload Interview PDF "},{"ques":"What is Under stitching?","ans":"Under stitching is Folding the entire seam allowance to the facing side or under- side and then stitching on the correct side of the facing close to the seam edge. This allows the seam to lie flat and keeps the seam edge from showing on the correct side of the garment."},{"ques":"What is Sheath?","ans":"Sheath means the Close-fitting dress with a straight skirt."},{"ques":"Tell me what is Roll?","ans":"Roll is the desired curve and fold (commonly on a collar); shaping established by pressing, pad stitching, etc."},{"ques":"What is Pin basting?","ans":"Pin basting is the technique of Pinning seams before stitching."},{"ques":"Tell me what is Layout?","ans":"Cutting chart on instruction guide sheet showing the place ment of pattern pieces."},{"ques":"What is Gather?","ans":"Gather means to draw up fabric fullness on a line of stitching."},{"ques":"What is Eyelet?","ans":"Eyelet is a small, round, finished hole in a garment or fabric."},{"ques":"What is Colorfast?","ans":"Colorfast means the Fabric that will not fade or run during cleaning or laundering."},{"ques":"What is Bodice?","ans":"Bodice means the Portion of garment above the waist."},{"ques":"What is Bias?","ans":"Bias is the Diagonal direction of fabric. True bias is at a 45-degree angle to the grain line.\n\nDownload Interview PDF "},{"ques":"What is dart?","ans":"A stitched fold that provides shape and fullness to a garment so that it fits the curves of the body"},{"ques":"What is trimming?","ans":"Trimming is Evenly cutting away part of the seam allowance ."},{"ques":"Tell me what is Batik Dyeing process?","ans":"Batik Dyeing process based on the principle of resisting dyeing process. In this technique, wax is used to design on the fabric and then immersed into a dye, and excluding wax parts the fabric will absorb the color."},{"ques":"Tell me what is ply yarns?","ans":"Two or more strands or yarns are twisted together; they are designed as ply yarns."},{"ques":"Tell me what is cotton fiber?","ans":"The cotton fiber grows in the seepod, or boll or the cotton plant. Cotton yarn is used to make fabries for all type of apparel, home furnishings and industrial applications."},{"ques":"What is metallic fibers?","ans":"Produced by mining and refining fibers such metals as aluminium, silver and gold."},{"ques":"What is Fiber?","ans":"Fiber, which is either spun (or twisted) into yarn or else directly compressed into fabric."},{"ques":"What is Stitching?","ans":"Stitching in the technique of sewing a straight stitch inconspicuously in the seam well on the correct side of a previously stitched seam. Used to complete waist- bands, cuffs, collars, and French bias binding."},{"ques":"What is Yoke?","ans":"Yoke is the fitted portion of a garment, usually at shoulders or hips, designed to support the rest of the garment hanging from it."},{"ques":"Tell me what is Tailoring?","ans":"Tailoring means the Construction technique requiring special hand sewing and pressing to mold fabric into a finished garment.\n\nDownload Interview PDF "},{"ques":"Tell me what is Shrinking?","ans":"Constricting fabric with steam or water to eliminate excess in a specific area. Also done to fabric before cutting out a garment to prevent further fabric shrinkage."},{"ques":"Explain what is seam?","ans":"Seam refers the Two or more edges of fabric held together by sewing. Seam should be well constructed and appropriate for the fabric, type of garment, and the location on the garment."},{"ques":"What is Pivot?","ans":"The Stitching around a corner by leaving the needle in the fabric, raising the presser foot, and turning the fabric in a new direction."},{"ques":"Explain me what is Pattern markings?","ans":"The symbols for construction printed on the pattern, such as for darts, buttonholes, notches, dots or tucks. They are transferred from the pattern to the fabric by means of tailor's tacks, notches, chalk, basting or tem porary fabric markers."},{"ques":"Explain me what is Interfacing?","ans":"A carefully selected fabric placed between the garment and the facing fabric for added body, to give support, and to maintain shape."},{"ques":"What is Fold line?","ans":"Fold line is the line where fabric is folded, usually vertically, when cutting out a garment. It is common for the center front of a garment to be placed on a fold line."},{"ques":"What is facing?","ans":"Facing is to finish an edge by applying a fitted piece of fabric, binding, etc. Also the right side of the fabric."},{"ques":"What is Edge stitching?","ans":"Edge stitching is the Stitching placed 1⁄16 inch from the edge; may be stitching detail, such as topstitching or stitching done to finish the outer edge of a seam or facing edge."},{"ques":"What is Clip?","ans":"Clip is a cut in fabric to allow ease on curves or corners. Also used to indicate notches in garment pattern."},{"ques":"What is Blouson?","ans":"Blouson means the Bloused effect of fullness gathered in at and falling over a seam, typically the bodice over a skirt.\n\nDownload Interview PDF "},{"ques":"What is Alter?","ans":"Alter means to change the pattern or garment so that it fits the body and represents body measurements and proportions."},{"ques":"What is Gathers?","ans":"Gathers meanstheTiny, soft folds of fabric formed when a larger piece of fabric is sewn to a smaller piece"},{"ques":"Tell me what are the fibres used in Textile Industry?","ans":"Three basic types of fibres used in Textile industries are\n\n☛ Synthetic fibres\n☛ Natural fibres\n☛ Cotton fibres"},{"ques":"Tell me what is silk fiber?","ans":"Is a fine continuous strand unwound from the cocoon of a moth caterpillar known as the silk worm. Silk is composed of protein. Lustrous, smooth, light weight, strong, and elastic. Used for apparel home furnishings, and upholstery."},{"ques":"What is rubber fibers?","ans":"Made from the sap tapped from the rubber tree."}]